Sudrien/m5tab5_m135_gnss_protomaps_live_area_map/sdkconfig.defaults
# ---- Compiler optimization -------------------------------------------------
# -O2 rather than the reference's -Os.
#
# This is a rendering and parsing workload - inflate.c, mvt.c and raster.c
# run over every tile that reaches the screen - and those are exactly the
# loops -Os declines to unroll or inline. The seek work either side of this
# was I/O bound and the CPU was not the limit; once the CLMT removes the FAT
# walk, decode is what is left.
#
# The choice is imported as CONFIG_COMPILER_OPTIMIZATION_SIZE=y (line ~133),
# and the reference also carries two deprecated aliases for the same choice
# near the end of its legacy block:
#
#     CONFIG_OPTIMIZATION_LEVEL_RELEASE=y
#     CONFIG_COMPILER_OPTIMIZATION_LEVEL_RELEASE=y
#
# both of which sdkconfig.rename maps onto COMPILER_OPTIMIZATION_SIZE. That
# is three lines selecting -Os, so it is worth being explicit about why one
# line here beats them: kconfiglib resolves a renamed symbol inline as it
# reads each line, not in a pass afterwards, so all three land as
# COMPILER_OPTIMIZATION_SIZE=y at their own position in the stream and this,
# being last, takes the choice. Same mechanism that lets the log level below
# override the reference's LOG_DEFAULT_LEVEL_ERROR.
#
# Configure therefore prints, and this is correct rather than a problem:
#
#     NOTE: Choice COMPILER_OPTIMIZATION has multiple active selections.
#     The last one will be used: COMPILER_OPTIMIZATION_PERF.
#
# The bootloader is deliberately left at -Os. Its partition is 0x6000 and
# already tight enough that raising its log level overflows it - see the
# diagnostics note below. It runs once, so there is nothing to win there.
#
# Costs: roughly 10-20% more .text, against 0x300000 of app partition, so
# check `idf.py size` rather than assuming. Assertions are a separate axis
# and stay on (ASSERTION_LEVEL=2) - this changes speed, not checking.
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# ---- TEMPORARY: diagnostics ------------------------------------------------
# The reference sets LOG_DEFAULT_LEVEL_ERROR, right for shipping and wrong
# while the board is being brought up: it silences heap_init and esp_psram.
# Not the bootloader's level - raising that overflows its 0x6000 partition.
#
# MAXIMUM at VERBOSE, DEFAULT at INFO. The maximum is compile-time: at INFO
# every ESP_LOGV is discarded by the preprocessor, and M5GFX logs its entire
# I2C probe at that level -
#     ESP_LOGV(LIBRARY_NAME, "[Autodetect] i2c addr:%02x = %s", ...)
# which is exactly what says whether the bus works and what answered. The
# default stays at INFO so nothing else floods; setup() raises M5GFX alone
# with esp_log_level_set("M5GFX", ESP_LOG_VERBOSE).
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y
